/*
问题 B: 长方形填充
时间限制: 1 Sec  内存限制: 128 MB
提交: 588  解决: 272
[提交][状态][讨论版]
题目描述
给定一个长方形的长和宽，以及一个可显示字符，用该字符在屏幕上画出该长方形（空心）
输入
由多行组成，每一个包括两个整数和一个字符,分别表示长，宽和填充字符
输出
对每一行输出一个长方形
样例输入
5 2 @
40 20 *
样例输出
@@@@@
@@@@@
****************************************
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
*                                      *
****************************************

*/
#include<stdio.h>
#include<windows.h>
int main()
{
	int a, b;
	char c;
	int i, j;
	while (scanf("%d %d %c",&a,&b,&c)==3)
	{
		for (i = 1; i <= a; i++)printf("%c", c);
		printf("\n");
		int n = b- 2;
		while (n--)
		{
			printf("%c", c);
			for (i = 1; i <= a - 2; i++)printf(" ");
			printf("%c\n", c);
		}
		for (i = 1; i <= a; i++)printf("%c", c);
		printf("\n");
	}
	system("pause");
	return 0;
}//输出超限